УТ_для_edt/src/Catalogs/смартIECHOСкидкиНаЗакупку/смартIECHOСкидкиНаЗакупку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартIECHOСкидкиНаЗакупку</name>
  <comment>//смарт:ММ #092 389 17.01.2021</comment>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.смартСпособыПредоставленияСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>Использована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/Enums/смартСпособыПредоставленияСкидок/смартСпособыПредоставленияСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСпособыПредоставленияСкидок</name>
  <comment>//смарт:ММ #092 389 17.01.2021</comment>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
  <enumValues>
    <name>Процент</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартIECHOСкидкиНаЗакупку/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Варианты = ДоступныеСпособыПредоставления();
	
	ГруппаСоздать = Элементы.ГруппаСоздать;
	
	Для Каждого ЭлементСписка Из Варианты.СкидкиНаценки Цикл
		ДобавитьКомандуВГруппу(ЭлементСписка, ЭтаФорма, ГруппаСоздать, "СкидкиНаценки");
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуДобавленияСкидкиНаценки(Команда)
	
	ОбработатьКомандуДобавленияСкидкиНаценки(
		ЭтотОбъект,
		Команда,
		Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////

Функция ДоступныеСпособыПредоставления() 
	
	ДоступныеСпособыПредоставленияСкидкиНаценки = Новый СписокЗначений;
	
	СпособыПредоставленияСкидкиНаценки = Новый Массив;
	СпособыПредоставленияСкидкиНаценки.Добавить(Перечисления.смартСпособыПредоставленияСкидок.Процент);
	СпособыПредоставленияСкидкиНаценки.Добавить(Перечисления.смартСпособыПредоставленияСкидок.Сумма);
	
	Для Каждого СпособПредоставления Из СпособыПредоставленияСкидкиНаценки Цикл
		ДоступныеСпособыПредоставленияСкидкиНаценки.Добавить(СпособПредоставления, Строка(СпособПредоставления));
	КонецЦикла;
	
	СпособыПредоставления = Новый Структура;
	СпособыПредоставления.Вставить("СкидкиНаценки", ДоступныеСпособыПредоставленияСкидкиНаценки);
	
	Возврат СпособыПредоставления;
	
КонецФункции

Процедура ДобавитьКомандуВГруппу(ЭлементСписка, Форма, ГруппаСоздать, Ключ)
	
	ИмяКоманды = "ПодключаемаяКоманда" + Ключ + (ГруппаСоздать.ПодчиненныеЭлементы.Количество() + 1);
	
	НоваяСтрока = Форма.КомандыУсловияПредоставления.Добавить();
	НоваяСтрока.ИмяКоманды = ИмяКоманды;
	НоваяСтрока.Значение = ЭлементСписка.Значение;
	
	КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
	КомандаФормы.Действие = "Подключаемый_ВыполнитьКомандуДобавленияСкидкиНаценки";
	КомандаФормы.Заголовок = ЭлементСписка.Представление;
	КомандаФормы.ИзменяетСохраняемыеДанные = Ложь;
	КомандаФормы.Отображение = ОтображениеКнопки.Авто;
	
	НовыйЭлемент = Форма.Элементы.Добавить("Кнопка"+ИмяКоманды, Тип("КнопкаФормы"), ГруппаСоздать);
	НовыйЭлемент.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКомандуДобавленияСкидкиНаценки(Форма, Команда, ТекущаяСтрока)
	
	Для Каждого СтрокаТЧ Из Форма.КомандыУсловияПредоставления Цикл
		
		Если СтрокаТЧ.ИмяКоманды = Команда.Имя Тогда
						
			СоздатьСкидкуНаценку(СтрокаТЧ.Значение, ТекущаяСтрока);
			
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСкидкуНаценку(СпособПредоставления, ДанныеДляЗаполненияРодителя = Неопределено)
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("Основание", Новый Структура(
		"ЕдиницаИзмерения, ДанныеДляЗаполненияРодителя",
		СпособПредоставления, ДанныеДляЗаполненияРодителя));
	
	ОткрытьФорму("Справочник.смартIECHOСкидкиНаЗакупку.Форма.ФормаЭлемента", СтруктураПараметры);

КонецПроцедуры
